InformationRegisters/КСУ_ПолученныеНовости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ПолученныеНовости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/КСУ_Новости/Ext/Module.bsl
Функция ПолучитьНовостьКСУ(ЭтоСтарт1С = истина) Экспорт
	
	Если ЭтоСтарт1С Тогда
		Если не ПолучатьНовостиПриСтарте() Тогда
			возврат Неопределено;
		КонецЕсли;
	Иначе
		Если не ПолучатьНовостиВКЦ() Тогда
			возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	АдресСервера = Константы.КСУ_АдресСервераНовостей.Получить();
	Если АдресСервера = "" Тогда
		возврат Неопределено;
	КонецЕсли;
	
	текПольз = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ПолученныеНовости.Дата КАК Дата,
	               |	КСУ_ПолученныеНовости.Пользователь КАК Пользователь,
	               |	КСУ_ПолученныеНовости.Прочитано КАК Прочитано,
	               |	КСУ_ПолученныеНовости.Содержание КАК Содержание
	               |ИЗ
	               |	РегистрСведений.КСУ_ПолученныеНовости КАК КСУ_ПолученныеНовости
	               |ГДЕ
	               |	КСУ_ПолученныеНовости.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Выборк = запрос.Выполнить().Выбрать();
		
	ПоследняяНовость = дата(1,1,1);
	СодрежаниеНовости = "";
	Если Выборк.Следующий() Тогда
		ПоследняяНовость = Выборк.Дата;
		Если не Выборк.Прочитано Тогда // не прочитали еще старое
			Возврат Выборк.Содержание;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Соединение = Новый HTTPСоединение(АдресСервера,,"KSU","BycfqnPfobnf",,5);
	Исключение
		сообщить(ОписаниеОшибки());
		возврат Неопределено;
	КонецПопытки;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();	
	ЗаписатьJSON(ЗаписьJSON, новый структура("fromDate",ПоследняяНовость));
	СтрокаДляЗапроса = ЗаписьJSON.Закрыть();
	
	HTTPЗапрос = Новый HTTPЗапрос("/ksu_news/hs/News/GetNew");
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса);
	
	Ответ = "";
	
	Попытка
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
	Исключение
		сообщить(ОписаниеОшибки());
		возврат Неопределено;
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния<>200 Тогда
		сообщить(Ответ);
		возврат Неопределено;
	КонецЕсли;
	
	чт = новый ЧтениеJSON;
	чт.УстановитьСтроку(Ответ);
	СтруктОтвет = ПрочитатьJSON(чт);
	
	Если СтруктОтвет.Дата = Неопределено или СтруктОтвет.Дата = null Тогда
		возврат Неопределено;
	КонецЕсли;
	
	мен = РегистрыСведений.КСУ_ПолученныеНовости.СоздатьМенеджерЗаписи();
	мен.Дата = ПолучитьДатуИзJS(СтруктОтвет.Дата);
	мен.Содержание = СтруктОтвет.Содержание;
	мен.Прочитано = ложь;
	мен.Пользователь = текПольз;
	мен.Записать(истина);
	
	Возврат СтруктОтвет.Содержание;
КонецФункции

Функция ПолучитьДатуИзJS(пДата) Экспорт
	врДата = СтрЗаменить(пДата," ","");
	врДата = СтрЗаменить(врДата,":","");
	врДата = СтрЗаменить(врДата,"-","");
	врДата = СтрЗаменить(врДата,"T","");
	врДата = СтрЗаменить(врДата,"Z","");
	возврат дата(врДата);
КонецФункции

Функция ПолучатьНовостиПриСтарте() Экспорт
	Возврат ПравоНовостей() И не ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.НеПолучатьНовостиПриЗапуске1С);
КонецФункции

Функция ПолучатьНовостиВКЦ() Экспорт
	Возврат ПравоНовостей() И не ИА_НастройкиС.ЗначениеНастройкиТекПользователя(ПланыВидовХарактеристик.ИА_НастройкиПользователей.НеПолучатьНовостиВКомцентре);
КонецФункции

Функция ПравоНовостей() Экспорт
	Возврат ПравоДоступа("Чтение", Метаданные.Константы.КСУ_АдресСервераНовостей);
КонецФункции
